## Plan Result (883: sbox_landing - TerraformPlanApply)




<pre><code>Plan: 102 to add, 35 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_access_policy.logging_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta001&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_access_policy.metadata_vault_reders[&#34;145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta002&#34;]
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.log_analytics_workspace_id
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.log_analytics_workspace_secret
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.mssql_password
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.mssql_username
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.mysql_connection_string
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.mysql_password
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.mysql_username
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.synapse_sql_password
  * module.data_landing_zone[&#34;09&#34;].azurerm_key_vault_secret.synapse_sql_username
  * module.data_landing_zone[&#34;09&#34;].azurerm_resource_group.this[&#34;logic&#34;]
  * module.logic[&#34;09&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;09&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;09&#34;].azurerm_resource_group_template_deployment.sqlConn
  * module.logic[&#34;09&#34;].azurerm_role_assignment.storage
  * module.logic[&#34;09&#34;].azurerm_service_plan.this
  * module.logic[&#34;09&#34;].azurerm_storage_account.this
  * module.logic[&#34;09&#34;].azurerm_storage_account_network_rules.this
  * module.data_landing_zone[&#34;09&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;09&#34;].module.logging_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;09&#34;].module.logging_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;09&#34;].module.logging_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;09&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;09&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.creator_access_policy
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.developer[0]
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;09&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest09landingsbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest09-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.runtimes_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest09curatedsbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest09rawsbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest09xcuttingsbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest09-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_sql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest09-meta001-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_key_vault.this[&#34;ingest09-meta002-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_sql_server.this[&#34;ingest09-metadata-mssql-sbox&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.dependants[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;curated-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;curated-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;purview&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;raw-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;raw-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;xcutting-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.azurerm_data_factory_managed_private_endpoint.this[&#34;xcutting-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-eventhub&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.dependant_private_endpoint_approvals[&#34;purview-storage-queue&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;curated-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;curated-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;keyvault&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;landing-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;mssql&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;purview&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;raw-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;raw-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;xcutting-blob&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shared_integration_datafactory.null_resource.private_endpoint_approvals[&#34;xcutting-dfs&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.shir001.azurerm_key_vault_secret.shir_password
  * module.data_landing_zone[&#34;09&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;09&#34;].module.shir001.azurerm_lb_backend_address_pool.shir
  * module.data_landing_zone[&#34;09&#34;].module.shir001.azurerm_lb_nat_pool.shir
  * module.data_landing_zone[&#34;09&#34;].module.shir001.azurerm_lb_probe.shir
  * module.data_landing_zone[&#34;09&#34;].module.shir001.azurerm_lb_rule.shir
  * module.data_landing_zone[&#34;09&#34;].module.shir001.azurerm_virtual_machine_scale_set_extension.shir_install
  * module.data_landing_zone[&#34;09&#34;].module.shir001.random_password.shir_password
  * module.logic[&#34;09&#34;].module.application_insights.azurerm_application_insights.this
  * module.logic[&#34;09&#34;].module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.data_landing_zone[&#34;09&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
  * module.data_landing_zone[&#34;09&#34;].module.shir001.module.shir_vmss.random_string.password
* Update
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_rule.rules[&#34;nsg-Allow-MoJ-RDP-Inbound&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;01&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;01&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;02&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;02&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;MetadataControl&#34;]
  * module.data_landing_zone[&#34;09&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;landing&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;09&#34;].module.storage[&#34;xcutting&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.data_landing_zone[&#34;01&#34;].module.legacy_database[&#34;legacy-sql&#34;].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["09"].azurerm_key_vault_access_policy.logging_vault_reders["145da22b-a3cb-4ba8-b735-22c94b5eea6c"] will be created
  + resource "azurerm_key_vault_access_policy" "logging_vault_reders" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["09"].azurerm_key_vault_access_policy.metadata_vault_reders["145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta001"] will be created
  + resource "azurerm_key_vault_access_policy" "metadata_vault_reders" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["09"].azurerm_key_vault_access_policy.metadata_vault_reders["145da22b-a3cb-4ba8-b735-22c94b5eea6c-meta002"] will be created
  + resource "azurerm_key_vault_access_policy" "metadata_vault_reders" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "145da22b-a3cb-4ba8-b735-22c94b5eea6c"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.log_analytics_workspace_id will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_id" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-logAnalytics001-sbox-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.log_analytics_workspace_secret will be created
  + resource "azurerm_key_vault_secret" "log_analytics_workspace_secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-logAnalytics001-sbox-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.mssql_password will be created
  + resource "azurerm_key_vault_secret" "mssql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-metadata-mssql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.mssql_username will be created
  + resource "azurerm_key_vault_secret" "mssql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-metadata-mssql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.mysql_connection_string will be created
  + resource "azurerm_key_vault_secret" "mysql_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-metadata-mysql-connection-string-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.mysql_password will be created
  + resource "azurerm_key_vault_secret" "mysql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-metadata-mysql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.mysql_username will be created
  + resource "azurerm_key_vault_secret" "mysql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-metadata-mysql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.synapse_sql_password will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-product-synapse001-sql-password-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_key_vault_secret.synapse_sql_username will be created
  + resource "azurerm_key_vault_secret" "synapse_sql_username" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ingest09-product-synapse001-sql-username-sbox"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.data_landing_zone["09"].azurerm_resource_group.this["logic"] will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ingest09-logic-sbox"
      + tags     = {
          + "Data-Ingest-Project" = "AJB Example Zone"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
    }

  # module.logic["09"].azurerm_logic_app_standard.this will be created
  + resource "azurerm_logic_app_standard" "this" {
      + app_service_plan_id                      = (known after apply)
      + app_settings                             = (known after apply)
      + bundle_version                           = "[1.*, 2.0.0)"
      + client_affinity_enabled                  = (known after apply)
      + custom_domain_verification_id            = (known after apply)
      + default_hostname                         = (known after apply)
      + enabled                                  = true
      + ftp_publish_basic_authentication_enabled = true
      + https_only                               = false
      + id                                       = (known after apply)
      + kind                                     = (known after apply)
      + location                                 = "uksouth"
      + name                                     = "ingest09-logic-sbox"
      + outbound_ip_addresses                    = (known after apply)
      + possible_outbound_ip_addresses           = (known after apply)
      + public_network_access                    = (known after apply)
      + resource_group_name                      = "ingest09-logic-sbox"
      + scm_publish_basic_authentication_enabled = true
      + site_credential                          = (known after apply)
      + storage_account_access_key               = (sensitive value)
      + storage_account_name                     = "ingest09logicsbox"
      + storage_account_share_name               = (known after apply)
      + tags                                     = {
          + "Data-Ingest-Project" = "AJB Example Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }
      + use_extension_bundle                     = true
      + version                                  = "~4"
      + virtual_network_subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest09-vnet-sbox/subnets/ingest09-data-product-001-sbox"

      + connection_string (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config (known after apply)
    }

  # module.logic["09"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest09logicsbox-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest09-logic-sbox"
      + subnet_id                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest09-vnet-sbox/subnets/ingest09-services-sbox"
      + tags                     = {
          + "Data-Ingest-Project" = "AJB Example Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest09logicsbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.logic["09"].azurerm_resource_group_template_deployment.sqlConn will be created
  + resource "azurerm_resource_group_template_deployment" "sqlConn" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "logicapp-sql-conn-deployment"
      + output_content      = (known after apply)
      + parameters_content  = (known after apply)
      + resource_group_name = "ingest09-logic-sbox"
      + template_content    = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + identityId = {
                      + type = "String"
                    }
                  + location   = {
                      + defaultValue = "[resourceGroup().location]"
                      + type         = "String"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2018-07-01-preview"
                      + kind       = "V2"
                      + location   = "[parameters('location')]"
                      + name       = "LogicAppSqlConn"
                      + properties = {
                          + api               = {
                              + id = "[format('/subscriptions/{0}/providers/Microsoft.Web/locations/{1}/managedApis/sql', subscription().subscriptionId, parameters('location'))]"
                            }
                          + authenticatedUser = {}
                          + displayName       = "sql"
                          + parameterValueSet = {
                              + name   = "oauthMI"
                              + values = {}
                            }
                        }
                      + type       = "Microsoft.Web/connections"
                    },
                  + {
                      + apiVersion = "2018-07-01-preview"
                      + dependsOn  = [
                          + "[resourceId('Microsoft.Web/connections', 'LogicAppSqlConn')]",
                        ]
                      + location   = "[parameters('location')]"
                      + name       = "[format('{0}/{1}', 'LogicAppSqlConn', 'LogicAppSqlConnAccessPolicies')]"
                      + properties = {
                          + principal = {
                              + identity = {
                                  + objectId = "[parameters('identityId')]"
                                  + tenantId = "[tenant().tenantId]"
                                }
                              + type     = "ActiveDirectory"
                            }
                        }
                      + type       = "Microsoft.Web/connections/accessPolicies"
                    },
                ]
              + variables      = {}
            }
        )
    }

  # module.logic["09"].azurerm_role_assignment.storage will be created
  + resource "azurerm_role_assignment" "storage" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.logic["09"].azurerm_service_plan.this will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "ingest09-app-service-plan-sbox"
      + os_type                         = "Windows"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "ingest09-logic-sbox"
      + sku_name                        = "WS1"
      + tags                            = {
          + "Data-Ingest-Project" = "AJB Example Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }
      + worker_count                    = (known after apply)
    }

  # module.logic["09"].azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "ingest09logicsbox"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

   + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["landing"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest09landingsbox"
        name                               = "ingest09landingsbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "AJB Example Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.storage["raw"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["raw"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest09rawsbox"
        name                               = "ingest09rawsbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "AJB Example Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.storage["workspace"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["workspace"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest09workspacesbox"
        name                               = "ingest09workspacesbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "AJB Example Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["09"].module.storage["xcutting"].data.azurerm_subscription.primary will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "primary" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.storage["xcutting"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest09xcuttingsbox"
        name                               = "ingest09xcuttingsbox"
      ~ sftp_enabled                       = true -> false
        tags                               = {
            "Data-Ingest-Project" = "AJB Example Zone"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (95 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.logic["09"].module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "data-landing-sbox"
      + resource_group_name                   = "ingest09-logic-sbox"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Data-Ingest-Project" = "AJB Example Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }
      + workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
    }

  # module.logic["09"].module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - data-landing-sbox"
      + resource_group_name = "ingest09-logic-sbox"
      + scopes              = (known after apply)
      + tags                = {
          + "Data-Ingest-Project" = "AJB Example Zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
        }

      + action {
          + action_group_id    = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actiongroups/sds-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = null
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)

          + resource_health (known after apply)

          + service_health (known after apply)
        }
    }

  # module.data_landing_zone["00"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest00-legacy-sql-sbox/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (8 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["01"].module.legacy_database["legacy-sql"].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "custom_script" {
        id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Compute/virtualMachines/ingest01-legacy-sql-sbox/extensions/HMCTSVMBootstrap"
        name                        = "HMCTSVMBootstrap"
      ~ protected_settings          = (sensitive value)
        tags                        = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (8 unchanged attributes hidden)
    }

  # module.data_landing_zone["01"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["02"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.shir001.module.shir_vmss.data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.data_landing_zone["09"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "VMAdmin"
      + computer_name_prefix                              = "shir001"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extension_operations_enabled                      = true
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "ingest09-shir001-vmss-sbox"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "ingest09-main-sbox"
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ds_v5"
      + tags                                              = {
          + "Data-Ingest-Project" = "AJB Example Zone"
          + "application"         = "dlrm-data-ingest"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Automatic"
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
        ]

      + automatic_instance_repair (known after apply)

      + extension (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "ingest09-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = (known after apply)
              + load_balancer_inbound_nat_rules_ids    = (known after apply)
              + name                                   = "ingest09-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest09-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest09-vnet-sbox/subnets/ingest09-services-sbox"
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }

      + spot_restore (known after apply)

      + termination_notification (known after apply)
    }

  # module.data_landing_zone["09"].module.shir001.module.shir_vmss.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 102 to add, 35 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 883: sbox_landing - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/dlrm-data-ingest-infra/issues/67/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":67,"Program":"tfcmt","SHA1":"","Target":"883: sbox_landing - TerraformPlanApply","Vars":{}} -->